docs/arkitektur/tilstander/NAVe 04-16.04.approved.md
```mermaid
   stateDiagram
   [*]-->MottattType
   	MottattType --> AvventerJournalpostType
	AvventerJournalpostType --> AvventerPersondataType
	AvventerPersondataType --> KategoriseringType
	KategoriseringType --> AvventerSøknadsdataType
    AvventerSøknadsdataType --> HåndterInnsendingType
    HåndterInnsendingType --> AventerArenaOppgaveType
    HåndterInnsendingType --> AvventerFerdigstillJournalpostType
	AventerArenaOppgaveType --> AvventerFerdigstillJournalpostType
	AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
   InnsendingFerdigstiltType--> [*]    
```
